In [2]:
import pandas as pd

In [40]:
sports=pd.read_csv('sports.csv',skiprows=2)
sports.head()

,Month,Golf: (United States),Soccer: (United States),Tennis: (United States),Hockey: (United States),Baseball: (United States)
0,2004-01,45,21,13,22,24
1,2004-02,50,24,13,23,32
2,2004-03,63,27,15,23,45
3,2004-04,80,29,16,16,53
4,2004-05,82,31,17,14,52

In [41]:
col_names = ['Month','Golf','Soccer','Tennis','Hockey','Baseball']
sports.columns = col_names
sports.set_index('Month',inplace=True)
sports.head()

         Golf  Soccer  Tennis  Hockey  Baseball
Month
2004-01    45      21      13      22        24
2004-02    50      24      13      23        32
2004-03    63      27      15      23        45
2004-04    80      29      16      16        53
2004-05    82      31      17      14        52

In [42]:
print(sports.shape)

(191, 5)

In [43]:
sports.describe()

             Golf      Soccer      Tennis      Hockey    Baseball
count  191.000000  191.000000  191.000000  191.000000  191.000000
mean    49.387435   28.853403   13.502618   14.879581   34.183246
std     18.247326    8.682073    4.067683    5.916182   14.037279
min     23.000000   17.000000    7.000000    6.000000   13.000000
25%     34.000000   24.000000   11.000000   11.000000   23.500000
50%     48.000000   28.000000   13.000000   15.000000   30.000000
75%     59.000000   32.000000   16.000000   18.000000   48.500000
max    100.000000   84.000000   26.000000   55.000000   61.000000

In [44]:
sports.describe().T

          count       mean        std   min   25%   50%   75%    max
Golf      191.0  49.387435  18.247326  23.0  34.0  48.0  59.0  100.0
Soccer    191.0  28.853403   8.682073  17.0  24.0  28.0  32.0   84.0
Tennis    191.0  13.502618   4.067683   7.0  11.0  13.0  16.0   26.0
Hockey    191.0  14.879581   5.916182   6.0  11.0  15.0  18.0   55.0
Baseball  191.0  34.183246  14.037279  13.0  23.5  30.0  48.5   61.0

In [45]:
sports.Golf.unique()

array([ 45,  50,  63,  80,  82, 100,  94,  85,  65,  42,  44,  61,  98,
        95,  86,  51,  43,  48,  57,  78,  76,  91,  88,  49,  41,  40,
        46,  56,  71,  77,  87,  62,  36,  39,  52,  68,  69,  90,  66,
        31,  33,  64,  74,  37,  32,  30,  58,  34,  27,  26,  35,  29,
        47,  75,  54,  55,  25,  53,  23,  59,  24,  28])

In [46]:
print('Max Per sports:\n',sports.max())

Max Per sports:
 Golf        100
Soccer       84
Tennis       26
Hockey       55
Baseball     61
dtype: int64

In [47]:
print('Min Per sports:\n',sports.min())

Min Per sports:
 Golf        23
Soccer      17
Tennis       7
Hockey       6
Baseball    13
dtype: int64

##### Measures of Central Tendency

In [48]:
print('Mean of sports: \n',sports.mean())

Mean of sports:
 Golf        49.387435
Soccer      28.853403
Tennis      13.502618
Hockey      14.879581
Baseball    34.183246
dtype: float64

In [49]:
print('Median of sports: \n', sports.median())

Median of sports:
 Golf        48.0
Soccer      28.0
Tennis      13.0
Hockey      15.0
Baseball    30.0
dtype: float64

In [50]:
print('Mode for Golf: \n',sports.Golf.mode())

Mode for Golf:
 0    26
dtype: int64

In [51]:
print('Ranges for sports \n',sports.max()-sports.min())
# Outliers can skew this

Ranges for sports
 Golf        77
Soccer      67
Tennis      19
Hockey      49
Baseball    48
dtype: int64

In [52]:
# PErcentile values
sports.describe(percentiles=[.1,.25,.5,.75,.9])

             Golf      Soccer      Tennis      Hockey    Baseball
count  191.000000  191.000000  191.000000  191.000000  191.000000
mean    49.387435   28.853403   13.502618   14.879581   34.183246
std     18.247326    8.682073    4.067683    5.916182   14.037279
min     23.000000   17.000000    7.000000    6.000000   13.000000
10%     28.000000   20.000000    9.000000    9.000000   17.000000
25%     34.000000   24.000000   11.000000   11.000000   23.500000
50%     48.000000   28.000000   13.000000   15.000000   30.000000
75%     59.000000   32.000000   16.000000   18.000000   48.500000
90%     77.000000   36.000000   20.000000   20.000000   54.000000
max    100.000000   84.000000   26.000000   55.000000   61.000000

In [53]:
# Inter quartile (25 percentile - 75 percentile)
from scipy.stats import iqr
IQR = iqr(sports['Golf'])
print('Inter Quartile Range for Golf',IQR)

Inter Quartile Range for Golf 25.0

##### Measure of Spread
'$\sigma = \sqrt {\mu _2 }$'

In [54]:
sports.count()

Golf        191
Soccer      191
Tennis      191
Hockey      191
Baseball    191
dtype: int64

In [55]:
sports.shape[0]

191

In [56]:
# Standard deviation tells you how much you data points deviate from the mean.
# Standard deviation is a measure of spread. IT ahs the same units as your data.
# How it;s calculated
diff = sports['Golf']-sports['Golf'].mean()
square_diff = diff**2
sum_squares = square_diff.sum()
total_divide=sum_squares/(sports.shape[0]-1)
squareroot_result=total_divide**0.5
print(squareroot_result)

18.247325664605434